/* Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.

A (3,6,8); B (2,1,-7), -> 15.84

A (7,-5, 0); B (1,-1,9) -> 11.53
*/

// void FindDistance(int aX, int aY, int aZ, int bX, int bY, int bZ){
//     Console.Write($"Координаты: aX: {aX}, aY: {aY}, aZ: {aZ}, bX: {bX}, bY: {bY}, bZ: {bZ}.{Environment.NewLine}");
//     var tmp = Math.Pow(bX - aX, 2) + Math.Pow(bY - aY, 2) + Math.Pow(bZ - aZ, 2);
//     Console.WriteLine($"Расстояние между двумя точками: {Math.Round(Math.Sqrt(tmp), 2)}.");
// }

// FindDistance(3,6,8, 2, 1, -7);