// Написать программу вычисления произведения чисел от 1 до N

// Console.Write("Введите число N: ");
// var N = int.Parse(Console.ReadLine()!);

// void CharMul(int N){
//     int result = 1;
//     for (int i = 1; i <= N; i++){
//         result *= i;
//     }
//     Console.WriteLine($"произведение цифр в числе от 1 до {N} = {result}");
// }

// CharMul(N);