/* Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
*/

// Console.Write("Введите число N: ");
// int n = Convert.ToInt32(Console.ReadLine());
// int counter = 1;

// void CounterToLow(int n, int counter){
//     if (n <= 0){
//         Console.Write($"{n} не натуральное число");
//     }else{
//         if (counter > n){
//             return;
//         } else {
//             CounterToLow(n, counter + 1);
//             Console.Write(counter + " ");
//         }
//     }
// }

// CounterToLow(n, counter);