/* Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. 
Напишите программу, которая покажет количество чётных чисел в массиве.

[345, 897, 568, 234] -> 2

*/


// Console.WriteLine("Введите длину массива: ");
// int size = Convert.ToInt32(Console.ReadLine());
// int[] numbers = new int[size];
// int count = 0;

// void PrintArray(int[] numbers)
// {
//     for(int i = 0; i < size; i++)
//     {
//         numbers[i] = new Random().Next(100,1000);
//     }
//     Console.Write("Значения в этом массиве: [ ");
//     for(int i = 0; i < numbers.Length; i++){
//         if (i != numbers.Length - 1){
//             Console.Write(numbers[i] + ", ");
//         } else if (i == numbers.Length - 1){
//             Console.Write(numbers[i] + ". ] \n");
//         }
//     }
// }

// PrintArray(numbers);

// for (int x = 0; x < numbers.Length; x++){
//     if (numbers[x] % 2 == 0) count++;
// }
// Console.WriteLine($"из {numbers.Length} чисел, четных -> {count} ");

