using System.Globalization;
/* Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

14212 -> нет

12821 -> да

23432 -> да
*/

// void IsPalindrom(int num){
//     string tmp = num.ToString(); 
//     if (tmp.Reverse().SequenceEqual(tmp)){
//         Console.WriteLine("Палиндром!");
//     } else {
//         Console.WriteLine("Не палиндром!");
//     } 
// }

// Console.Write("Введите пятизначное число: ");
// var num = int.Parse(Console.ReadLine()!);
// string numLength = num.ToString();
// if (numLength.Length < 5){
//     Console.WriteLine("Не пятизначное число!");
// } else{
//     IsPalindrom(num);
// }



