/* Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

3 -> 1, 8, 27
5 -> 1, 8, 27, 64, 125
*/

// Console.Write("Введите число: ");
// var num = int.Parse(Console.ReadLine()!);

// void LineN(int num){
//     for (int i = 1; i <= num; i++){
//         if(i < num){
//             Console.Write($"{Math.Pow(i, 3)}, ");
//         } else if (i == num){
//             Console.Write($"{Math.Pow(i, 3)}.");
//         }
//     }
// }

// LineN(num);